{
    "lines": [
        {
            "line": "\"Oh god, slow down\", he said but they both already knew it was too late for that. He was completely at her mercy and when she moved up her hips, let him slide out and reached down to give him a few last strokes he didn't even need the touch. As soon as his dick felt the cold air ProtA exploded {, hot, sticky cum shooting all across his stomach|, giving him a taste of his own medicine}.{| ProtB leaned down, pressing a kiss on his cheek {and held|while the orgasm was still going strong, holding} {his twitching dick through the period of intense struggle with a grin on her face|him}.}{|\"Holy shit\", ProtB grinned, \"{How long did you hold that for?|you are drenched.|you are fucking drenched.}\"}",
            "genderdirection": "mf",
            "cowgirl": true,
            "external": true
        },
        {
            "line": "ProtA couldn't stand the sight of her naked body any longer{|, couldn't imagine just another thrust without {spilling|shooting|busting|thrusting} his {seed|cum} into her} and so he pulled out, leaving a hot and welcoming pussy for the cold air{| of reality}.{| His spunk flew out before he could reach down, aimlessly spraying her inner thigh and ass as he desperately tried to give his dick a last few strokes. }By the time his hand came down he had already spilled the last spurt and his hot cum was already{ running down her leg and |}soaking the sheets below them. ",
            "genderdirection": "mf",
            "spoon": true,
            "external": true
        },
        {
            "line": "\"Don't.Pull.Out\", ProtB said between gritted teeth and if he had needed any more reason to finally let loose and drain his balls that was it. {Another thrust, balls deep into her and then |}ProtA just stayed still, waiting for the twitches to subside{| in the knowledge that he had just emptied a week's worth of cum into her| knowing that was a week's worth of cum flowing into her| while he gave her a last, thorough massage}.",
            "genderdirection": "mf",
            "missionary": true,
            "doggystyle": true,
            "cowgirl": true,
            "spoon": true,
            "internal": true
        },
        {
            "line": "Her moans turned into sighs, her hands clenched to fists as she tried to hold onto thin air - but to no avail as ProtAName's next thrust pushed her over the edge, making her eyes turn over and every single muscle in her body tighten up.",
            "genderdirection": "fm",
            "missionary": true,
            "doggystyle": true,
            "cowgirl": true,
            "spoon": true,
            "internal": false
        }
    ]
}